<!--Información del curso-->
<img align="left" style="padding-right:10px;" src="figuras/logo_ciencia_datos.png">

<center><h1 style="font-size:2em;color:#2467C0"> Pandas - Parte 2  </h1></center>

<center><h4 style="font-size:2em;color:#840700">  Pandas -  Indexación y selección de datos    </h4></center>

<br>
<table>
<col width="550">
<col width="450">
<tr>
<td><img src="figuras/pandas1.png" align="left" style="width:500px"/></td>
<td>

* **Wes McKinney**, empezó a desarrollar Pandas en el año 2008 mientras trabajaba en *AQR Capital* por la necesidad que tenía de una herramienta flexible de alto rendimiento para realizar análisis cuantitativo en datos financieros. 
* Antes de dejar AQR convenció a la administración de la empresa de distribuir esta biblioteca bajo licencia de código abierto.
* **Pandas** es un acrónimo de **PANel DAta analysiS**
   
    
<br>
</td>
</tr>
</table>

# Librerías

Cargando las bibliotecas que necesitamos

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

En unidad 2, analizamos en detalle los métodos y herramientas para acceder a los arreglos de _**NumPy**_. Estos incluyeron indexación (por ejemplo, ``arr[2, 1]``), segmentación (por ejemplo, ``arr[:, 1:5]``), a través de máscaras (por ejemplo, ``arr[arr > 0]``), indexación elegante (por ejemplo, ``arr[0, [1, 5]]``) y combinaciones de los mismos (por ejemplo,arr[:, [1, 5]]). 
Aquí veremos medios similares para acceder a las **Series** y **DataFrames** de _**Pandas**_, los cuales le resultarán muy familiares, aunque hay algunas peculiaridades que debe tener en cuenta.

# Selección de datos en Series

Como vimos en la lección anterior, una **Serie** es muy similar a un arreglo unidimensional  de NumPy y en muchas formas, como un diccionario estándar de Python.
Si tenemos en cuenta estas dos analogías superpuestas, nos ayudará a comprender los patrones de indexación y selección de datos en las **Series**.

## Series como diccionario

Como en un diccionario, una **Serie** proporciona un mapeo de una colección de etiquetas a una colección de valores:

In [37]:
#data representará las ganancias en millones de dólares de una empresa
import pandas as pd
data = pd.Series([0.25, 2.5, 1.75, 1.1, 1.8, 2.1],
                 index=['enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio'])
data

enero      0.25
febrero    2.50
marzo      1.75
abril      1.10
mayo       1.80
junio      2.10
dtype: float64

In [38]:
#mostrar los datos de febrero
data['febrero']

2.5

También podemos usar expresiones y métodos de Python similares a los de un diccionario para examinar las etiquetas/índices y valores:

In [39]:
#Saber si la etiqueta marzo esta en data
'marzo' in data

True

In [40]:
#Saber si la etiqueta octubre esta en data
'octubre'in data

False

In [41]:
#Mostrar las etiquetas
data.index

Index(['enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio'], dtype='object')

In [42]:
#Mostrar los elementos en una lista de tuplas
list(data.items())

[('enero', 0.25),
 ('febrero', 2.5),
 ('marzo', 1.75),
 ('abril', 1.1),
 ('mayo', 1.8),
 ('junio', 2.1)]

Los elementos de una **Serie** incluso se pueden modificar con una sintaxis similar a la de un diccionario.

In [43]:
# Asignar a enero el valor de 1.5
data['enero']=1.5
data

enero      1.50
febrero    2.50
marzo      1.75
abril      1.10
mayo       1.80
junio      2.10
dtype: float64

## Series como un arreglo unidimensional

Una **Serie*** se basa en esta interfaz similar a un diccionario y proporciona una selección de elementos de estilo de un arreglo de _**Numpy**_ es decir: *selección*, *enmascaramiento* e *indexación elegante*.
Ejemplos de estos son los siguientes:

In [44]:
# segmentación por índice explícito
data['enero':'abril']

enero      1.50
febrero    2.50
marzo      1.75
abril      1.10
dtype: float64

In [45]:
# segmentación por índice entero
data[0:4]

enero      1.50
febrero    2.50
marzo      1.75
abril      1.10
dtype: float64

In [46]:
# enmascaramiento para obtener la salida para elementos mayores a 1 y menores a 2
#marzo    1.75
#abril    1.10
#mayo     1.80
data[(data>1) & (data<2)]

enero    1.50
marzo    1.75
abril    1.10
mayo     1.80
dtype: float64

In [47]:
# fancy indexing
data[['enero', 'abril', 'mayo']]

enero    1.5
abril    1.1
mayo     1.8
dtype: float64

**IMPORTANTE:** Tenga en cuenta que al segmentar con un índice explícito (es decir, ``datos ['enero': 'abril']``), el índice final se *incluye* en el segmento, mientras que cuando se divide con un índice implícito (es decir, ``data [0: 2]``), el índice final se *excluye* del segmento.

## Indexadores  ``loc`` y ``iloc``

Las convenciones previas de segmentación e indexación pueden ser una fuente de confusión. Por ejemplo:

<img align="left" width=60% src="figuras/indices3.png">

In [48]:
data = pd.Series(['febrero', 'abril', 'junio'], index=[1, 3, 5])
data

1    febrero
3      abril
5      junio
dtype: object

In [49]:
# índice explícito  
data[3]

'abril'

In [50]:
# índices implícitos  
data[1:3]

3    abril
5    junio
dtype: object

Debido a esta posible confusión en el caso de índices enteros, Pandas proporciona algunos atributos *indexadores* especiales que exponen explícitamente ciertos esquemas de indexación.

### Indexador: loc

Primero, el atributo ``loc`` permite indexar y segmentar que siempre hace referencia al índice explícito (el índice que se muestra):

In [20]:
data

1    febrero
3      abril
5      junio
dtype: object

In [19]:
# Obtener con loc 
# 'febrero'
data.loc[1]

'febrero'

In [53]:
# Obtener con loc 
# 1    febrero
# 3      abril
data.loc[1:3]

1    febrero
3      abril
dtype: object

### Indexador: iloc

El atributo ``iloc`` permite indexar y segmentar haciendo referencia al índice implícito (el índice que es debido a su posición 0,1,2,3... ) de estilo Python:

In [54]:
data

1    febrero
3      abril
5      junio
dtype: object

In [55]:
# Obtener con iloc 
# 'abril'
data.iloc[0]

'febrero'

In [56]:
# Obtener con iloc 
#3    abril
#5    junio
data.iloc[1:3]

3    abril
5    junio
dtype: object

La naturaleza explícita de ``loc`` y ``iloc`` los hace muy útiles para mantener un código limpio y legible; especialmente en el caso de índices enteros, recomiendo usarlos tanto para hacer el código más fácil de leer y entender, como para prevenir errores sutiles debido a la convención mixta de indexación/segmentación.

# Selección de datos en DataFrames

Recuerde que un **DataFrame** actúa de muchas formas como un arreglo bidimensional, y de otras formas como un diccionario de estructuras de **Series**  que comparten el mismo índice.
Puede ser útil tener en cuenta estas analogías a medida que exploramos la selección de datos dentro de esta estructura.

## DataFrame como un diccionario

La primera analogía que consideraremos es el **DataFrame** como diccionario. Utilizaremos el siguiente DataFrame el cual tiene información de diferentes países

In [57]:
poblacion  = pd.Series({'Belgica': 11.3, 'Francia': 64.3,
                  'Alemania': 81.3, 'Holanda': 16.9,
                  'Inglaterra': 64.9, 'Argentina': 12.1,
                  'Mexico': 103.2,
                 })

area  = pd.Series({'Belgica': 30510, 'Francia': 671308,
                  'Alemania': 357050, 'Holanda': 41526,
                  'Inglaterra': 244820, 'Argentina':300163 ,
                  'Mexico': 1960573,
                 })


capital = pd.Series({'Belgica': 'Bruselas', 'Francia': 'Paris',
                  'Alemania': 'Berlin', 'Holanda': 'Amsterdam',
                  'Inglaterra': 'Londres', 'Argentina': 'Buenos Aires' ,
                  'Mexico': 'Ciudad de Mexico',
                 })
paises = pd.DataFrame({'Poblacion':poblacion, 'Area':area, 'Capital':capital}) #se unen o combinan las series, creando asi un DataFram
paises

            Poblacion     Area           Capital
Belgica          11.3    30510          Bruselas
Francia          64.3   671308             Paris
Alemania         81.3   357050            Berlin
Holanda          16.9    41526         Amsterdam
Inglaterra       64.9   244820           Londres
Argentina        12.1   300163      Buenos Aires
Mexico          103.2  1960573  Ciudad de Mexico

Se puede acceder a las **Series** individuales que componen las columnas del  **Datafrma** mediante la indexación del nombre de la columna al estilo de diccionario:

In [58]:
paises['Poblacion']

Belgica        11.3
Francia        64.3
Alemania       81.3
Holanda        16.9
Inglaterra     64.9
Argentina      12.1
Mexico        103.2
Name: Poblacion, dtype: float64

In [118]:
paises[1:3:6]['Area']

Francia    671308
Name: Area, dtype: int64

Esta sintaxis estilo diccionario también se puede usar para modificar el **DataFrame**, en este caso agregando una nueva columna:

In [59]:
paises['Densidad'] = paises['Poblacion'] / paises['Area']
paises

            Poblacion     Area           Capital  Densidad
Belgica          11.3    30510          Bruselas  0.000370
Francia          64.3   671308             Paris  0.000096
Alemania         81.3   357050            Berlin  0.000228
Holanda          16.9    41526         Amsterdam  0.000407
Inglaterra       64.9   244820           Londres  0.000265
Argentina        12.1   300163      Buenos Aires  0.000040
Mexico          103.2  1960573  Ciudad de Mexico  0.000053

Este ultimo ejemplo nos muestra una manera sencilla de operar entre elementos, en las lecciones siguientes profundizaremos en este tema.

### DataFrame como un arreglo bidimensional

Como se mencionó anteriormente, también podemos ver el **DataFrame** como un arreglo bidimensional mejorado.
Podemos examinar el arreglo de datos subyacentes  utilizando el atributo `values`` :

In [60]:
#values
paises.values

array([[11.3, 30510, 'Bruselas', 0.0003703703703703704],
       [64.3, 671308, 'Paris', 9.578315765639617e-05],
       [81.3, 357050, 'Berlin', 0.00022769920179246603],
       [16.9, 41526, 'Amsterdam', 0.00040697394403506234],
       [64.9, 244820, 'Londres', 0.0002650927211829099],
       [12.1, 300163, 'Buenos Aires', 4.031143078927116e-05],
       [103.2, 1960573, 'Ciudad de Mexico', 5.263767276199356e-05]],
      dtype=object)

Tomando el primer elemento:

In [61]:
#values[0]
paises.values[0]

array([11.3, 30510, 'Bruselas', 0.0003703703703703704], dtype=object)

Pasando solo  el "índice" a de la columna:

In [62]:
# 'Area'
paises['Area']

Belgica         30510
Francia        671308
Alemania       357050
Holanda         41526
Inglaterra     244820
Argentina      300163
Mexico        1960573
Name: Area, dtype: int64

Usando el indexador ``iloc``, podemos indexar al arreglo subyacente como si fuera un arreglo simple de _**NumPy**_ (usando el índice implícito de estilo Python), pero el índice de **DataFrame** y las etiquetas de columna se mantienen en el resultado:

<img align="left" width=60% src="figuras/indices5.png">

In [63]:
paises.iloc[:3,:2]

          Poblacion    Area
Belgica        11.3   30510
Francia        64.3  671308
Alemania       81.3  357050

De manera similar, usando el indexador ``loc`` podemos indexar los datos subyacentes usando el índice explícito y los nombres de columna:

In [98]:
paises.loc[:'Alemania',:'Area']

          Poblacion    Area
Belgica        11.3   30510
Francia        64.3  671308
Alemania       81.3  357050

Cualquiera de estas convenciones de indexación también se puede utilizar para establecer o modificar valores; esto se hace de la forma estándar a la que podría estar acostumbrado al trabajar con _**NumPy**_:

In [65]:
#Cambiando la población de Mexico de 103.2 a 120.0
paises.iloc[6,0]

103.2

También podemos seleccionar columnas múltiples pasando una lista de nombres de columnas:

In [66]:
#Seleccionar la columna Area y Poblacion
paises.iloc[6,0] = 120
paises

            Poblacion     Area           Capital  Densidad
Belgica          11.3    30510          Bruselas  0.000370
Francia          64.3   671308             Paris  0.000096
Alemania         81.3   357050            Berlin  0.000228
Holanda          16.9    41526         Amsterdam  0.000407
Inglaterra       64.9   244820           Londres  0.000265
Argentina        12.1   300163      Buenos Aires  0.000040
Mexico          120.0  1960573  Ciudad de Mexico  0.000053

In [67]:
#Seleccionar las columnas de Area y poblacion 
paises[['Area', 'Poblacion']]

               Area  Poblacion
Belgica       30510       11.3
Francia      671308       64.3
Alemania     357050       81.3
Holanda       41526       16.9
Inglaterra   244820       64.9
Argentina    300163       12.1
Mexico      1960573      120.0

### Selección por medio de filtrado booleano

Frecuentemente es necesario filtrar elementos que cumplan algún criterio, al igual que en _**NumPy**_ es posible utilizar **máscaras** con condiciones booleanas

In [21]:
# Paises con área mayor a 100000 km2
paises['Area'] > 100000 #We apply a mask to filter the data tath we need

Belgica       False
Francia        True
Alemania       True
Holanda       False
Inglaterra     True
Argentina      True
Mexico         True
Name: Area, dtype: bool

In [22]:
paises[ paises['Area'] > 100000 ]# La mascara boleana se pone como condicion en el DataFrame, primero se genera la mascara

            Poblacion     Area           Capital  Densidad
Francia          64.3   671308             Paris  0.000096
Alemania         81.3   357050            Berlin  0.000228
Inglaterra       64.9   244820           Londres  0.000265
Argentina        12.1   300163      Buenos Aires  0.000040
Mexico          120.0  1960573  Ciudad de Mexico  0.000053

In [23]:
# Paises con población mayor a los 50 millones
#paises['Poblacion'] > 50
paises[ paises['Poblacion'] > 50 ]

            Poblacion     Area           Capital  Densidad
Francia          64.3   671308             Paris  0.000096
Alemania         81.3   357050            Berlin  0.000228
Inglaterra       64.9   244820           Londres  0.000265
Mexico          120.0  1960573  Ciudad de Mexico  0.000053

In [24]:
# Paises con población mayor a los 50 millones y mostrando solamente su densidad
paises['Densidad'][ paises['Poblacion'] > 50 ]

Francia       0.000096
Alemania      0.000228
Inglaterra    0.000265
Mexico        0.000053
Name: Densidad, dtype: float64

In [26]:
# Paises con publación mayor a los 50 millones y menor o igual a los 100 millones
#(paises['Poblacion'] > 50) & (paises['Poblacion'] <100 )
paises[ ( paises[ 'Poblacion' ] > 50 ) & ( paises[ 'Poblacion' ] <100 ) ]

            Poblacion    Area  Capital  Densidad
Francia          64.3  671308    Paris  0.000096
Alemania         81.3  357050   Berlin  0.000228
Inglaterra       64.9  244820  Londres  0.000265

In [27]:
# Paises con publación mayor a los 50 millones y menor o igual a los 100 millones y mostrando solo su área  
paises['Area'][(paises['Poblacion'] > 50) & (paises['Poblacion'] <100 ) ]

Francia       671308
Alemania      357050
Inglaterra    244820
Name: Area, dtype: int64

Una descripción general de las posibles operaciones de comparación:

Operador   |  Descripción
------ | --------
==       | Equal
!=       | Not equal
>       | Greater than
>=       | Greater than or equal
<       | Lesser than
!=       | Lesser than or equal

y para combinar múltiples condiciones:

Operador   |  Descripción
------ | --------
&       | And (`cond1 & cond2`)
\|       | Or (`cond1 \| cond2`)

# Ejercicio

Los siguientes datos contienen nombres, direcciones, empresas y números de teléfono ficticios del Reino Unido.

In [69]:
#Cargamos los datos en un DataFrame
uk_data = pd.read_csv('datos/uk-500.csv')

In [70]:
#Mostramos las primeros  5 filas
uk_data.head()

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web
0,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk
1,Evan,Zigomalas,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk
2,France,Andrade,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk
3,Ulysses,Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk
4,Tyisha,Veness,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk

In [75]:
#Mostramos las últimas 5 filas
uk_data.tail()

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web
495,Avery,Veit,Plaza Gourmet Delicatessen,9166 Devon St #905,Knightsbridge and Belgravia Wa,Greater London,SW1W 8JY,01748-625058,01369-185737,avery@veit.co.uk,http://www.plazagourmetdelicatessen.co.uk
496,Reid,Euresti,"Fitzgerald, Edward J",70 Foster St,Inverness Ness-Side Ward,Highland,IV2 6WT,01916-963261,01370-319414,reuresti@euresti.co.uk,http://www.fitzgeraldedwardj.co.uk
497,Charlette,Brenning,Furey & Associates,714 Fonthill Rd,Darton West Ward,South Yorkshire,S75 5EJ,01888-152110,01301-312487,cbrenning@brenning.co.uk,http://www.fureyassociates.co.uk
498,Celestina,Keeny,Bfg Federal Credit Union,9 Milton St,Consett North ED,County Durham,DH8 5LP,01877-379681,01600-463475,celestina_keeny@gmail.com,http://www.bfgfederalcreditunion.co.uk
499,Mi,Richan,Nelson Wright Haworth Golf Crs,6 Norwood Grove,Tanworth-in-Arden,Warwickshire,B94 5RZ,01451-785624,01202-738406,mi@hotmail.com,http://www.nelsonwrighthaworthgolfcrs.co.uk

<div class="alert alert-success">
    
1. Selección simple: Utilizando **iloc** encuentre las siguientes filas y columnas
    
**Filas**:
    
a) primera fila (datos de Aleshia Tomkiewicz)
    
b) segunda fila (datos de Evan Zigomalas)
    
c) última fila (datos de Mi Richan)
    
**Columnas**:
    
d) primera columna (first_name)
    
e) tercera columna (company_name)
    
f) última columna (web)
</div>

In [72]:
uk_data.iloc[0]

first_name                                   Aleshia
last_name                                 Tomkiewicz
company_name                 Alan D Rosenburg Cpa Pc
address                                 14 Taylor St
city                               St. Stephens Ward
county                                          Kent
postal                                       CT2 7PP
phone1                                  01835-703597
phone2                                  01944-369967
email                        atomkiewicz@hotmail.com
web             http://www.alandrosenburgcpapc.co.uk
Name: 0, dtype: object

In [74]:
uk_data.iloc[1]

first_name                                   Evan
last_name                               Zigomalas
company_name                   Cap Gemini America
address                               5 Binney St
city                                   Abbey Ward
county                            Buckinghamshire
postal                                   HP11 2AX
phone1                               01937-864715
phone2                               01714-737668
email                    evan.zigomalas@gmail.com
web             http://www.capgeminiamerica.co.uk
Name: 1, dtype: object

In [83]:
uk_data.iloc[499]

first_name                                               Mi
last_name                                            Richan
company_name                 Nelson Wright Haworth Golf Crs
address                                     6 Norwood Grove
city                                      Tanworth-in-Arden
county                                         Warwickshire
postal                                              B94 5RZ
phone1                                         01451-785624
phone2                                         01202-738406
email                                        mi@hotmail.com
web             http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: 499, dtype: object

In [87]:
uk_data['first_name']

0        Aleshia
1           Evan
2         France
3        Ulysses
4         Tyisha
         ...
495        Avery
496         Reid
497    Charlette
498    Celestina
499           Mi
Name: first_name, Length: 500, dtype: object

In [88]:
uk_data['last_name']

0      Tomkiewicz
1       Zigomalas
2         Andrade
3       Mcwalters
4          Veness
          ...
495          Veit
496       Euresti
497      Brenning
498         Keeny
499        Richan
Name: last_name, Length: 500, dtype: object

In [89]:
uk_data['web']

0             http://www.alandrosenburgcpapc.co.uk
1                http://www.capgeminiamerica.co.uk
2                 http://www.elliottjohnwesq.co.uk
3                     http://www.mcmahanbenl.co.uk
4                   http://www.champagneroom.co.uk
                          ...
495      http://www.plazagourmetdelicatessen.co.uk
496             http://www.fitzgeraldedwardj.co.uk
497               http://www.fureyassociates.co.uk
498         http://www.bfgfederalcreditunion.co.uk
499    http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: web, Length: 500, dtype: object

<div class="alert alert-success">
    
2. Seleccionar varias columnas y filas usando el indexador **iloc**

a) primeras cinco filas del DataFrame 
    
b) primeras dos columnas del DataFrame con todas las filas
    
c) (1ª, 4ª, 7ª, 25ª) filas + (1ª, 6ª, 7ª) columnas    
    
d) primeras 5 filas y (5ª, 6ª, 7ª) columnas  
    
</div>

In [92]:
#a) primeras cinco filas del DataFrame
uk_data.iloc[:5]

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web
0,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk
1,Evan,Zigomalas,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk
2,France,Andrade,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk
3,Ulysses,Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk
4,Tyisha,Veness,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk

In [106]:
#b) primeras dos columnas del DataFrame con todas las filas
uk_data[['first_name', 'last_name']]

    first_name   last_name
0      Aleshia  Tomkiewicz
1         Evan   Zigomalas
2       France     Andrade
3      Ulysses   Mcwalters
4       Tyisha      Veness
..         ...         ...
495      Avery        Veit
496       Reid     Euresti
497  Charlette    Brenning
498  Celestina       Keeny
499         Mi      Richan

[500 rows x 2 columns]

In [163]:
uk_data.iloc[[22,24]]

,first_name,company_name,address,city,county,postal,phone1,phone2,email,web
last_name,,,,,,,,,,
Teplica,Martha,"Curtin, Patricia M Esq",148 Rembrandt St,Warlingham,Surrey,CR6 9SW,01677-684257,01583-287367,mteplica@teplica.co.uk,http://www.curtinpatriciamesq.co.uk
Sitra,Tess,Smart Signs,61 Rossett St,Chichester,West Sussex,PO19 1RH,01473-229124,01848-116775,tess_sitra@hotmail.com,http://www.smartsigns.co.uk

In [160]:
#c) (1ª, 4ª, 7ª, 25ª) filas + (1ª, 6ª, 7ª) columnas
uk_data[ ( uk_data[ 'first_name' ] == 'Aleshia' ) | ( uk_data[ 'first_name' ] == 'Ulysses' ) | ( uk_data[ 'first_name' ] == 'Marg' ) | ( uk_data[ 'first_name' ] == 'Tess' ) ] [['city','email']]

                          city                    email
last_name
Tomkiewicz   St. Stephens Ward  atomkiewicz@hotmail.com
Mcwalters   Hawerby cum Beesby      ulysses@hotmail.com
Grasmick          Bargate Ward         marg@hotmail.com
Sitra               Chichester   tess_sitra@hotmail.com

In [164]:
#c) (1ª, 4ª, 7ª, 25ª) filas + (1ª, 6ª, 7ª) columnas
uk_data.iloc[ [0,3,6,24] ] [ ['city','email'] ]

                          city                    email
last_name
Tomkiewicz   St. Stephens Ward  atomkiewicz@hotmail.com
Mcwalters   Hawerby cum Beesby      ulysses@hotmail.com
Grasmick          Bargate Ward         marg@hotmail.com
Sitra               Chichester   tess_sitra@hotmail.com

In [169]:
#d) primeras 5 filas y (5ª, 6ª, 7ª) columnas
uk_data.head()[ ['county','postal', 'phone1'] ]

                     county    postal        phone1
last_name
Tomkiewicz             Kent   CT2 7PP  01835-703597
Zigomalas   Buckinghamshire  HP11 2AX  01937-864715
Andrade         Bournemouth   BH6 3BE  01347-368222
Mcwalters      Lincolnshire  DN36 5RP  01912-771311
Veness        West Midlands   B70 9DT  01547-429341

Ahora estableciendo el índice de nuestro DataFrame con el "last_name":

In [168]:
uk_data.set_index('last_name', inplace=True)

KeyError: "None of ['last_name'] are in the columns"

<div class="alert alert-success">

3. Utilizar el indexador **loc** y encuentre lo siguiente:


a)  Seleccione filas con valores de índice 'Andrade' y 'Veness', con  las columnas entre 'city' y 'email'

b)  Seleccione las mismas filas de a), con solo las columnas 'first_name', 'address' y 'city'
 


</div>

In [174]:
#a) Seleccione filas con valores de índice 'Andrade' y 'Veness', con las columnas entre 'city' y 'email'
uk_data.loc[ 'Andrade':'Veness'][['city','email']] #Don't forget to use double '[]' in the sellection of the colums

                                     city                       email
last_name
Andrade    East Southbourne and Tuckton W  france.andrade@hotmail.com
Mcwalters              Hawerby cum Beesby         ulysses@hotmail.com
Veness         Greets Green and Lyng Ward   tyisha.veness@hotmail.com

In [175]:
#b) Seleccione las mismas filas de a), con solo las columnas 'first_name', 'address' y 'city'
uk_data.loc[ 'Andrade':'Veness'][['first_name', 'address', 'city']]

          first_name            address                            city
last_name
Andrade       France       8 Moor Place  East Southbourne and Tuckton W
Mcwalters    Ulysses      505 Exeter Rd              Hawerby cum Beesby
Veness        Tyisha  5396 Forth Street      Greets Green and Lyng Ward

<div class="alert alert-success">

4. Utilizar la selección boolena y encuentre lo siguiente:


a)  Seleccionar todas las filas con el nombre de "Antonio".

b)  Seleccione las mismas filas de a), con solo las columnas 'first_name', 'address' y 'city'
 


</div>

In [176]:
uk_data['first_name'] == 'Antonio'

last_name
Tomkiewicz    False
Zigomalas     False
Andrade       False
Mcwalters     False
Veness        False
              ...
Veit          False
Euresti       False
Brenning      False
Keeny         False
Richan        False
Name: first_name, Length: 500, dtype: bool

In [178]:
#a) Seleccionar todas las filas con el nombre de "Antonio".
uk_data[ uk_data['first_name'] == 'Antonio']

,first_name,company_name,address,city,county,postal,phone1,phone2,email,web
last_name,,,,,,,,,,
Villamarin,Antonio,Combs Sheetmetal,353 Standish St #8264,Little Parndon and Hare Street,Hertfordshire,CM20 2HT,01559-403415,01388-777812,antonio.villamarin@gmail.com,http://www.combssheetmetal.co.uk
Glasford,Antonio,Saint Thomas Creations,425 Howley St,Gaer Community,Newport,NP20 3DE,01463-409090,01242-318420,antonio_glasford@glasford.co.uk,http://www.saintthomascreations.co.uk
Heilig,Antonio,Radisson Suite Hotel,35 Elton St #3,Ipplepen,Devon,TQ12 5LL,01324-171614,01442-946357,antonio.heilig@gmail.com,http://www.radissonsuitehotel.co.uk

In [179]:
#b) Seleccione las mismas filas de a), con solo las columnas 'first_name', 'address' y 'city'
uk_data[ uk_data['first_name'] == 'Antonio'] [['first_name', 'address', 'city']]

           first_name                address                            city
last_name
Villamarin    Antonio  353 Standish St #8264  Little Parndon and Hare Street
Glasford      Antonio          425 Howley St                  Gaer Community
Heilig        Antonio         35 Elton St #3                        Ipplepen